src/test/resources/sample-requests/DeleteJobRequest_1.xml

﻿<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header/>
    <SOAP-ENV:Body>
        <ns2:SendDeleteJobRequestMessage xmlns:ns1="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns2="http://schemas.consiliumtechnologies.com/services/mobile/2009/03/messaging" xmlns:opt="http://schemas.consiliumtechnologies.com/mobile/2015/05/OptimiseMessages.xsd" xmlns:opt1="http://schemas.consiliumtechnologies.com/mobile/2015/05/OptimiseTypes.xsd">
            <!--Optional:-->
            <ns2:SendMessageRequestInfo>
                <ns2:QueueName>\OPTIMISE\INPUT</ns2:QueueName>
                <ns2:Key>Test</ns2:Key>
            </ns2:SendMessageRequestInfo>
            <!--Optional:-->
            <ns2:DeleteJobRequest>
                <opt:Identity>
                    <opt1:Reference>Testa</opt1:Reference>
                </opt:Identity>
            </ns2:DeleteJobRequest>
        </ns2:SendDeleteJobRequestMessage>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>